// 웹 서비스 개발 완료되면, 배포를 해서, 사용자에게 소프트웨어를 전달해야 함 

// 배포를 하기 위해 필요한 건, '제 3 자'가 접속할 수 있는 '서버 컴퓨터' 가 필요.
    // '서버 컴퓨터' 는 365일, 24시간 내내 켜 있어야. 
    // 서버 컴퓨터를 대여해주는 호스팅 업체를 통해, 배포를 진행

// 호스팅은 1) 서버 호스팅 2) 웹 호스팅 으로 나뉨 
    // 1) 서버 호스팅 : '물리 서버' 를 '단독' 으로 임대 및 구매 
    // 2) 웹 호스팅 : 서버의 일부 공간을 임대하는 개념 (컴퓨터를 잘게 쪼갠 것) (잘게 쪼개서 일부를 나눠주는)
        // 장점 : 서버, 인프라 구축이 필요 없음. 비용이 저렴. 
        // 단점 : 자원이 한정적임. 단독 서버에 비해 사용량이 제한적.


// 웹 호스팅 업체중 하나인 AWS 통해서, 서버를 배포할 것
// laaS : 컴퓨터 자원만 제공하는 형태 (AWS) Infrastructure as a service : 컴퓨터의 자원만 제공 
// PaaS : 헤로쿠, 넷플리파이 등등, 기존 환경에서 서비스를 바로 올려주는 형태.  배포가 편해. 설정하기가 힘듦.

// 🔷 aws 순서 👉 옵시디언에 필기  
    // 인스턴스 ec
    // / 리전 

// 🔷 인스턴스에 mysql 설치 : 옵시에 필기 


